ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/*
 * F1 — Basic motor spin, F2 — encoder RPM read
 * Edge AMR / SLAM robot — Week 2, Phase 2 (Firmware)
 *
 * F1: drive both TT motors forward at a fixed 50% PWM to prove the
 * ESP32 -> TB6612FNG -> motor path works end to end.
 * F2: count LM393 encoder pulses via ISR, compute RPM every 1s.
 * Merged into one project because F3 (PID) needs both together anyway.
 *
 * Pin map (ESP32 38-pin DevKit  ->  TB6612FNG):
 *   GPIO16 -> PWMA      GPIO17 -> PWMB     (speed  — driven by LEDC)
 *   GPIO18 -> AIN1      GPIO21 -> BIN1     (direction)
 *   GPIO19 -> AIN2      GPIO22 -> BIN2     (direction)
 *   GPIO23 -> STBY                         (enable, HIGH = run)
 *   3V3    -> VCC   (logic power)
 *   VM     <- powerbank (direct, bypasses ESP32 — fixed 2026-07-24)
 *   GND    -> GND   (must be common with the powerbank ground)
 *
 * Pin map (ESP32 -> LM393 encoders):
 *   GPIO34 -> left encoder OUT   (input-only pin, no internal pull-up needed —
 *   GPIO35 -> right encoder OUT   LM393 module has its own onboard pull-up)
 *
 * F2 test procedure (do this BEFORE trusting F3/PID):
 *   Comment out the "wake the TB6612FNG" + direction lines in app_main so
 *   the motors stay off, flash, then spin each wheel by hand and confirm
 *   the RPM printed on the serial monitor looks sane. Only once that's
 *   verified, uncomment and let both F1 (motor) and F2 (encoder) run together.
 */

#include <math.h>
#include <stdbool.h>
#include <string.h>
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "driver/uart.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "esp_err.h"
#include "esp_log.h"
#include "esp_timer.h"
#include <rcl/rcl.h>
#include <rcl/error_handling.h>
#include <rclc/rclc.h>
#include <rclc/executor.h>
#include <geometry_msgs/msg/twist.h>
#include <nav_msgs/msg/odometry.h>
#include <rmw_microros/rmw_microros.h>
#include "esp32_serial_transport.h"

/* --- Direction + enable pins: plain digital outputs (HIGH/LOW only) --- */
#define AIN1_PIN  GPIO_NUM_18
#define AIN2_PIN  GPIO_NUM_19
#define BIN1_PIN  GPIO_NUM_21
#define BIN2_PIN  GPIO_NUM_22
#define STBY_PIN  GPIO_NUM_23

/* --- Speed pins: driven by the LEDC PWM peripheral, not set by hand --- */
#define PWMA_PIN  GPIO_NUM_16
#define PWMB_PIN  GPIO_NUM_17

#define PWM_FREQ_HZ  1000   /* 1 kHz PWM carrier */
#define PWM_DUTY_50  128    /* 128 / 255 = 50% duty (8-bit resolution) */

/* --- F2: encoder pins + RPM constants --- */
#define ENC_L_PIN GPIO_NUM_34   /* left encoder signal */
#define ENC_R_PIN GPIO_NUM_35   /* right encoder signal */
#define SLOTS_PER_REV 20        /* LM393 disk: 20 slots = 1 full wheel revolution */

/* Moved up from near control_task() (2026-07-27): pid_step() needs this for
 * its dt calculation, but #define order matters in C - the compiler had
 * never actually seen this macro yet at the point pid_step() used it,
 * since the old location was much further down in the file. That was a
 * silent build failure (`'CONTROL_PERIOD_MS' undeclared`), not a subtle
 * bug - every build since Ki was added failed here, meaning any test
 * result since then that "worked" was very likely re-flashing a stale,
 * older binary rather than the code we thought we were testing.
 *
 * Original context for the value itself: shorter window = coarser RPM
 * resolution with only 20 slots/rev. Raised 50ms -> 200ms (2026-07-27):
 * at 50ms, 1 pulse = 60 RPM/step, and a since-changed 30 RPM test target
 * sat exactly BETWEEN two measurable levels - the controller could never
 * read "at target". At 200ms, 1 pulse = 15 RPM/step - finer, though RPM
 * itself no longer depends on this window at all now (see last_interval_us
 * / RPM_STALE_US further down - period measurement replaced pulse
 * counting for the actual RPM value). This constant now only sets how
 * often PID/sync/PWM update, not measurement resolution. */
#define CONTROL_PERIOD_MS 200   /* 5 Hz */

/* --- F3: PI velocity control (Kd deliberately skipped, see KI comment below) --- */
/* TARGET_RPM (hardcoded 30, then 60) retired 2026-07-27 now that F5 wires
 * real /cmd_vel - per-wheel targets are computed live from linear.x/angular.z
 * instead (see the F5 section below). Kept using it through F1-F4 was the
 * right call (needed *some* number to validate the control loop before the
 * real command source existed) - it's just no longer the source of truth. */
#define KP 3.0f            /* start small, increase until oscillation appears, back off */

/* Added 2026-07-27: P-only data showed the right wheel settling ~15 RPM
 * below TARGET_RPM consistently (30-60 RPM band, target 60) - a textbook
 * P-only steady-state error, not noise (resolution is now 15 RPM/step,
 * fine enough to trust this as real). KI=0.2 is a conservative starting
 * guess, same "start small" approach as KP.
 * Kd deliberately NOT added: RPM is still a coarse step signal (15 RPM/step
 * @ 5Hz) - differentiating a stair-step amplifies jitter into PWM swings
 * ("derivative kick") rather than smoothing anything. PI is the standard
 * choice for velocity/RPM loops anyway; Kd matters more for position
 * control. Revisit only if PI alone proves insufficient. */
#define KI 0.2f

/* Anti-windup: without this, the integral term grows unbounded whenever
 * output is pinned at MIN/MAX_SAFE_PWM - exactly what happened during
 * today's left-wheel stall (PWM=100, RPM=0, for 10+ seconds straight).
 * An unclamped integral would have kept accumulating that whole time, then
 * caused a huge overshoot the moment the wheel freed up. Caps the integral
 * term's own contribution to output, independent of Kp's contribution. */
#define MAX_I_CONTRIBUTION 40.0f
#define MAX_INTEGRAL (MAX_I_CONTRIBUTION / KI)

/* Wheel sync: per-wheel PID keeps each wheel near TARGET_RPM independently,
 * but confirmed live (2026-07-27) that's not enough - robot pulls right,
 * would circle if left running. Small per-cycle differences between the two
 * (different motors, different overshoot/settling) add up over time into
 * real position drift. This trims each wheel's target RPM based on TOTAL
 * distance traveled so far (cumulative pulses, never reset), not just
 * instantaneous RPM - a wheel that's fallen behind gets sped up until it
 * actually catches up, not just "goes the same speed from now on".
 * KSYNC=0.05 is a conservative starting guess, same philosophy as Kp/Ki.
 * Gated 2026-07-27 (F5): only active while /cmd_vel's angular.z is near
 * zero (straight-line driving) - an intentional turn deliberately makes the
 * two wheels travel different distances, and without this gate the sync
 * logic would fight every turn command, trying to "correct" a difference
 * that was never a mistake. See STRAIGHT_ANGULAR_THRESHOLD below. */
#define KSYNC 0.05f
#define MAX_SYNC_TRIM 15.0f   /* clamp: don't let sync fighting dominate over the base target */

/* --- F4: odometry (measured 2026-07-27: wheel diameter 6cm, wheelbase 10cm) ---
 * distance per pulse = wheel circumference / slots per rev - converts a raw
 * pulse count directly into linear distance traveled by that wheel.
 * Differential-drive kinematics: center-of-robot distance is the AVERAGE of
 * the two wheels' distances (if both go the same distance, robot moves
 * straight with no turn); heading change is the DIFFERENCE divided by the
 * wheelbase (if right travels further than left, robot rotates toward the
 * left/slower side - matches the direction convention already confirmed
 * earlier today: faster right wheel -> drifts left). */
#define WHEEL_DIAMETER_M 0.06f
#define WHEELBASE_M 0.10f
#define PI_F 3.14159265f   /* not relying on M_PI - not guaranteed defined by every libc without _USE_MATH_DEFINES */
#define WHEEL_CIRCUMFERENCE_M (PI_F * WHEEL_DIAMETER_M)
#define DISTANCE_PER_PULSE_M (WHEEL_CIRCUMFERENCE_M / SLOTS_PER_REV)

/* --- F5: /cmd_vel in, /odom out (2026-07-27) ---
 * Safety default: if no /cmd_vel received within this long (agent crash,
 * USB unplugged, Jetson down), treat commanded velocity as 0 rather than
 * keep driving on the last command received - a lost connection must mean
 * "stop", never "keep going blind". Applies both before the first command
 * ever arrives AND if a live connection drops mid-drive. */
#define CMD_VEL_TIMEOUT_US 1000000   /* 1s */

/* Below this |angular.z|, treat the commanded motion as "going straight" for
 * wheel-sync purposes (see KSYNC comment above) - not exactly 0 because a
 * genuinely-straight command from ros2/Nav2 may carry tiny floating-point
 * noise rather than a clean 0.0. */
#define STRAIGHT_ANGULAR_THRESHOLD 0.05f   /* rad/s */

