ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
#define ODOM_PUBLISH_PERIOD_MS 100   /* 10 Hz */

static const char *TAG = "control_task";

/* Shared between ISR (writer) and control_task (reader) -> must be volatile
 * so the compiler never caches a stale copy in a register. */
static volatile uint32_t pulse_count_left = 0;
static volatile uint32_t pulse_count_right = 0;

/* Latest computed RPM, exposed for uros_task (F5) to read later. */
static volatile float rpm_left_shared = 0.0f;
static volatile float rpm_right_shared = 0.0f;

/* F5: /cmd_vel, written by uros_task's subscription callback, read by
 * control_task. last_cmd_vel_us is the watchdog clock - see
 * CMD_VEL_TIMEOUT_US comment above. */
static volatile float cmd_linear_x = 0.0f;
static volatile float cmd_angular_z = 0.0f;
static volatile int64_t last_cmd_vel_us = 0;

/* F5: pose + velocity, written by control_task (F4 odometry math), read by
 * uros_task to publish /odom. Plain floats (not the mutex-protected pulse
 * counters) - a torn read here would be a stale/slightly-off reading, not a
 * silently-corrupted control decision, so it's not worth the locking. */
static volatile float pose_x_shared = 0.0f;
static volatile float pose_y_shared = 0.0f;
static volatile float pose_theta_shared = 0.0f;
static volatile float linear_vel_shared = 0.0f;
static volatile float angular_vel_shared = 0.0f;

/* Spinlock used to make "read + reset" atomic (avoids the lost-pulse race
 * where a pulse arrives between reading the counter and zeroing it). */
static portMUX_TYPE encoder_mux = portMUX_INITIALIZER_UNLOCKED;

/* Debounce: while the motor is actually running (not hand-spun), PWM
 * switching edges and DC-brush arcing couple electrical noise onto the
 * encoder signal line, which the ISR was counting as real slot transitions
 * (confirmed 2026-07-27: hand-spinning gave clean 0-60 RPM, motor-running
 * gave RPM spiking as high as 6300). Reject edges that arrive faster than
 * any real slot transition physically could - at TARGET_RPM=30 the real
 * interval is ~100ms, so there's large margin to push this threshold up.
 * 3ms wasn't enough (tested 2026-07-27: cut peak noise from RPM=6300 down
 * to RPM=540, but R still noisy vs. L's clean 0/60) - PWM runs at 1kHz
 * (1ms period), so switching noise can recur faster than a 3ms window
 * rejects. Raised to 15ms, still >>3x below the real ~50ms interval. */
#define MIN_PULSE_INTERVAL_US 15000

static volatile int64_t last_edge_us_left = 0;
static volatile int64_t last_edge_us_right = 0;

/* 2026-07-27, after fixing a bad encoder solder joint: with clean pulses,
 * RPM was still visibly jumping in fixed steps (0, 15, 30, 45...) with no
 * in-between values. Root cause: counting whole pulses in a fixed 200ms
 * window can only ever measure in units of "1 pulse / window" = 15 RPM -
 * a motor spinning at, say, 22 RPM is invisible to that method. Fixed by
 * also recording the time BETWEEN consecutive pulses (`last_interval_us`),
 * so control_task can compute RPM from timing instead of counting - the
 * standard "period measurement" tachometer technique, far finer resolution
 * at low speed than "frequency measurement" (pulse-counting) gives. */
static volatile int64_t last_interval_us_left = 0;
static volatile int64_t last_interval_us_right = 0;

typedef struct {
    volatile uint32_t *counter;
    volatile int64_t *last_edge_us;
    volatile int64_t *last_interval_us;
} encoder_isr_arg_t;

static encoder_isr_arg_t enc_left_arg  = { &pulse_count_left,  &last_edge_us_left,  &last_interval_us_left };
static encoder_isr_arg_t enc_right_arg = { &pulse_count_right, &last_edge_us_right, &last_interval_us_right };

/* One ISR handles both pins; `arg` tells it which counter/debounce-clock to use.
 * IRAM_ATTR: ISR code must live in IRAM so it still runs even while
 * flash cache is temporarily disabled (standard ESP-IDF requirement).
 * esp_timer_get_time() is documented safe to call from ISR context. */
static void IRAM_ATTR encoder_isr_handler(void *arg) {
    encoder_isr_arg_t *a = (encoder_isr_arg_t *)arg;
    int64_t now = esp_timer_get_time();
    int64_t since_last = now - *(a->last_edge_us);

    if (since_last < MIN_PULSE_INTERVAL_US) {
        return;   /* too soon to be a real slot transition - noise, drop it */
    }
    *(a->last_interval_us) = since_last;
    *(a->last_edge_us) = now;
    (*(a->counter))++;   /* only this otherwise. No math, no logging, no delays in an ISR. */
}

static void encoder_gpio_init(void) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << ENC_L_PIN) | (1ULL << ENC_R_PIN),
        .mode = GPIO_MODE_INPUT,
        /* GPIO34/35 are input-only pins anyway (can't drive internal
         * pull-up/down), and the LM393 module already has its own. */
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_POSEDGE,   /* rising edge only */
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    gpio_install_isr_service(0);
    gpio_isr_handler_add(ENC_L_PIN, encoder_isr_handler, (void *)&enc_left_arg);
    gpio_isr_handler_add(ENC_R_PIN, encoder_isr_handler, (void *)&enc_right_arg);
}

/* VM now has its own wire from the powerbank (fixed 2026-07-24, see README
 * "Power Architecture") — the brownout reset loop this cap was guarding
 * against is confirmed gone. Left at 100 for now since Kp hasn't been
 * retuned with valid encoder data yet; raise deliberately, not by default,
 * once real RPM tracking data says the controller needs more headroom. */
#define MAX_SAFE_PWM 100.0f

/* Floor, not just a "can't go negative" clamp: the powerbank feeding VM
 * auto-shuts-off when it sees low/no current draw (no-load detection meant
 * for phone charging, wrong assumption for a motor). Lowered 40 -> 20
 * (2026-07-27, power confirmed stable since the hardware fix) because 40
 * was clamping the right wheel's PWM even though its actual RPM sat well
 * above TARGET_RPM=30 - PID couldn't slow it down further to reach target.
 * Lowered again 20 -> 10 (same day, real ground test): right wheel still
 * pinned at PWM=20 with RPM 150-195 (vs. left's ~45) while actually driving
 * - the sync-trim fix couldn't help because PID still couldn't push PWM any
 * lower. This is a diagnostic test as much as a fix: if RPM stays this high
 * even at PWM=10, the cause isn't the floor anymore, it's a real mechanical/
 * motor asymmetry - raise the floor back if the powerbank cuts out. */
#define MIN_SAFE_PWM 10.0f

/* error(t) = target - actual; u(t) = Kp*error(t) + Ki*integral(t);
 * PWM = clamp(u(t), MIN_SAFE_PWM, MAX_SAFE_PWM). `integral` is per-wheel
 * state owned by the caller (control_task) since left/right run independent
 * loops - it persists across calls, unlike everything else in here.
 *
 * BUG FOUND 2026-07-27 (F5 first test): MIN_SAFE_PWM was clamping the
 * output even when target_rpm==0 - the F5 safety watchdog forces target
 * to 0 on a stale/missing /cmd_vel, but the floor was overriding that,
 * so the robot never actually stopped (kept driving on no command at all,
 * confirmed live - x drifted past 2m unattended). Explicit target==0
 * bypass added below: a commanded stop means PWM=0, full stop, no floor -
 * the floor only makes sense while the robot is supposed to be moving.
 * Also resets the integral so a long stop doesn't leave stale windup to
 * bias the next real command. */
static uint32_t pid_step(float target_rpm, float actual_rpm, float *integral) {
    if (target_rpm == 0.0f) {
        *integral = 0.0f;
        return 0;
    }

