ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
    float error = target_rpm - actual_rpm;
    float dt = CONTROL_PERIOD_MS / 1000.0f;

    *integral += error * dt;
    if (*integral > MAX_INTEGRAL)  *integral = MAX_INTEGRAL;   /* anti-windup clamp, see MAX_INTEGRAL comment */
    if (*integral < -MAX_INTEGRAL) *integral = -MAX_INTEGRAL;

    float u = KP * error + KI * (*integral);

    if (u < MIN_SAFE_PWM)   u = MIN_SAFE_PWM;   /* clamp: floor keeps current draw above the powerbank's auto-shutoff threshold */
    if (u > MAX_SAFE_PWM)   u = MAX_SAFE_PWM;   /* clamp: temporary current-safety ceiling, not the LEDC max */

    return (uint32_t)u;
}

/* Caps how much the applied PWM can change in one cycle, regardless of how
 * big a jump pid_step() wants. This limits di/dt on the shared power rail —
 * a sudden PWM jump stresses a marginal supply harder than the same
 * steady-state current reached gradually. Does not replace the VM rewire;
 * it reduces (not eliminates) brownout risk while that's still pending. */
#define MAX_PWM_STEP_PER_CYCLE 10.0f

static float slew_limit(float applied, float target) {
    if (target > applied + MAX_PWM_STEP_PER_CYCLE) return applied + MAX_PWM_STEP_PER_CYCLE;
    if (target < applied - MAX_PWM_STEP_PER_CYCLE) return applied - MAX_PWM_STEP_PER_CYCLE;
    return target;
}

/* Encoder read + PID + PWM write, all in ONE task/cycle — replaces the old
 * separate encoder_task (1 Hz) + pid_task (100 Hz). That split meant PID
 * recomputed 100x/sec against an RPM value that was up to 1 full second
 * stale. Running both halves in the same 20 Hz loop means PID always acts
 * on the reading from THIS cycle — zero cross-task staleness.
 * (CONTROL_PERIOD_MS itself now lives up near SLOTS_PER_REV - pid_step()
 * needs it too, and #define order matters in C.) */

/* Companion to the period-measurement RPM calc above: period measurement
 * alone can't distinguish "stopped" from "just hasn't ticked yet" - without
 * a timeout it would keep reporting the last (increasingly stale) interval
 * forever after the wheel actually stops. If no new pulse arrives within
 * this long, treat RPM as 0 instead. ~500ms is generous margin (~10x) over
 * the ~50ms/pulse interval expected near TARGET_RPM=60. */
#define RPM_STALE_US 500000

/* Silent-failure guard: if PWM is clearly high enough to move the wheel but
 * pulse count stays 0 for this many consecutive cycles, the encoder is
 * almost certainly dead (misaligned, unglued, wiring fault) rather than the
 * wheel legitimately being stopped. 20 cycles = 4s at 5Hz (was 1s at the old
 * 20Hz) — one slot alone only needs ~100ms at TARGET_RPM, so this still has
 * generous margin against false positives from startup transients. */
#define STALL_PWM_THRESHOLD 30.0f
#define STALL_CYCLE_LIMIT   20

static void control_task(void *arg) {
    encoder_gpio_init();

    uint32_t snapshot_left, snapshot_right;
    float applied_pwm_left = 0.0f, applied_pwm_right = 0.0f;
    float integral_left = 0.0f, integral_right = 0.0f;
    uint32_t total_pulses_left = 0, total_pulses_right = 0;
    uint32_t stall_cycles_left = 0, stall_cycles_right = 0;
    /* F4 pose lives in pose_x_shared/pose_y_shared/pose_theta_shared now
     * (F5 needs uros_task to read it) - origin = wherever the robot is at
     * boot/flash, all initialized 0 at file scope. */
    TickType_t last_wake = xTaskGetTickCount();
    const TickType_t period = pdMS_TO_TICKS(CONTROL_PERIOD_MS);

    while (1) {
        vTaskDelayUntil(&last_wake, period);

        int64_t now = esp_timer_get_time();
        int64_t last_edge_left, last_edge_right, interval_left, interval_right;

        portENTER_CRITICAL(&encoder_mux);
        snapshot_left = pulse_count_left;
        pulse_count_left = 0;
        snapshot_right = pulse_count_right;
        pulse_count_right = 0;
        /* int64_t isn't atomic on a 32-bit MCU (two word-writes) - read these
         * inside the same critical section as the pulse counts to avoid a
         * torn read racing the ISR mid-update. */
        last_edge_left   = last_edge_us_left;
        last_edge_right  = last_edge_us_right;
        interval_left    = last_interval_us_left;
        interval_right   = last_interval_us_right;
        portEXIT_CRITICAL(&encoder_mux);

        /* RPM from time between pulses, not pulses-per-window - see
         * last_interval_us / RPM_STALE_US comments above for why. */
        rpm_left_shared = (interval_left == 0 || (now - last_edge_left) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_left);
        rpm_right_shared = (interval_right == 0 || (now - last_edge_right) > RPM_STALE_US)
                              ? 0.0f : 60000000.0f / (SLOTS_PER_REV * (float)interval_right);

        /* F4 odometry: how far each wheel moved THIS cycle (not cumulative),
         * then combine into how far the robot's center moved + how much it
         * turned. Midpoint integration (average current and new heading,
         * not just the old one) instead of plain Euler - at 200ms/cycle a
         * turning robot's heading can shift enough mid-cycle that using only
         * the pre-turn heading for the whole cycle's distance would visibly
         * bias x/y, especially while turning sharply. */
        float dist_left  = snapshot_left  * DISTANCE_PER_PULSE_M;
        float dist_right = snapshot_right * DISTANCE_PER_PULSE_M;
        float dist_center = (dist_left + dist_right) / 2.0f;
        float dtheta = (dist_right - dist_left) / WHEELBASE_M;
        float theta_mid = pose_theta_shared + dtheta / 2.0f;
        float dt = CONTROL_PERIOD_MS / 1000.0f;

        pose_x_shared += dist_center * cosf(theta_mid);
        pose_y_shared += dist_center * sinf(theta_mid);
        pose_theta_shared += dtheta;
        linear_vel_shared  = dist_center / dt;
        angular_vel_shared = dtheta / dt;

        /* F5: /cmd_vel -> per-wheel target RPM. Watchdog: stale command (or
         * none ever received) means 0, not "keep driving" - see
         * CMD_VEL_TIMEOUT_US comment above. */
        bool cmd_vel_fresh = (now - last_cmd_vel_us) <= CMD_VEL_TIMEOUT_US;
        float linear_x  = cmd_vel_fresh ? cmd_linear_x  : 0.0f;
        float angular_z = cmd_vel_fresh ? cmd_angular_z : 0.0f;

        float v_left_mps  = linear_x - angular_z * WHEELBASE_M / 2.0f;
        float v_right_mps = linear_x + angular_z * WHEELBASE_M / 2.0f;
        float target_rpm_left  = v_left_mps  / WHEEL_CIRCUMFERENCE_M * 60.0f;
        float target_rpm_right = v_right_mps / WHEEL_CIRCUMFERENCE_M * 60.0f;

