ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
        /* Wheel sync, gated to straight-line motion only - see KSYNC and
         * STRAIGHT_ANGULAR_THRESHOLD comments above. Positive diff = left
         * has traveled further than right so far; trim left's target down /
         * right's target up to close that gap. */
        bool going_straight = fabsf(angular_z) < STRAIGHT_ANGULAR_THRESHOLD;
        if (going_straight) {
            total_pulses_left  += snapshot_left;
            total_pulses_right += snapshot_right;
        }
        float sync_diff = (float)total_pulses_left - (float)total_pulses_right;
        float sync_trim = going_straight ? KSYNC * sync_diff : 0.0f;
        if (sync_trim > MAX_SYNC_TRIM)  sync_trim = MAX_SYNC_TRIM;
        if (sync_trim < -MAX_SYNC_TRIM) sync_trim = -MAX_SYNC_TRIM;

        float target_pwm_left  = (float)pid_step(target_rpm_left  - sync_trim, rpm_left_shared,  &integral_left);
        float target_pwm_right = (float)pid_step(target_rpm_right + sync_trim, rpm_right_shared, &integral_right);

        applied_pwm_left  = slew_limit(applied_pwm_left,  target_pwm_left);
        applied_pwm_right = slew_limit(applied_pwm_right, target_pwm_right);

        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0, (uint32_t)applied_pwm_left);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_0);
        ledc_set_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1, (uint32_t)applied_pwm_right);
        ledc_update_duty(LEDC_HIGH_SPEED_MODE, LEDC_CHANNEL_1);

        /* Stall watch, left wheel */
        if (applied_pwm_left > STALL_PWM_THRESHOLD && snapshot_left == 0) {
            stall_cycles_left++;
            if (stall_cycles_left == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "LEFT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_left, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_left = 0;
        }

        /* Stall watch, right wheel */
        if (applied_pwm_right > STALL_PWM_THRESHOLD && snapshot_right == 0) {
            stall_cycles_right++;
            if (stall_cycles_right == STALL_CYCLE_LIMIT) {
                ESP_LOGW(TAG, "RIGHT encoder stall suspected: PWM=%.0f but 0 pulses for %ds",
                         applied_pwm_right, STALL_CYCLE_LIMIT * CONTROL_PERIOD_MS / 1000);
            }
        } else {
            stall_cycles_right = 0;
        }

        /* NOTE (F5): once uros_task's custom transport claims UART0, this
         * won't show up on idf.py monitor anymore - debug via `ros2 topic
         * echo /odom` / `ros2 topic pub /cmd_vel` on the Jetson instead.
         * Left in place since it's harmless and still useful for standalone
         * bring-up before uros_task's transport takes over. */
        ESP_LOGI(TAG, "RPM L=%.1f R=%.1f  PWM L=%.0f R=%.0f  sync_diff=%.0f trim=%.1f  "
                      "pose x=%.3fm y=%.3fm theta=%.1fdeg",
                 rpm_left_shared, rpm_right_shared, applied_pwm_left, applied_pwm_right,
                 sync_diff, sync_trim, pose_x_shared, pose_y_shared, pose_theta_shared * 180.0f / PI_F);
    }
}

/* rclc_executor callback for the /cmd_vel subscription - just latches the
 * values and timestamps them for the watchdog. Runs in uros_task's context
 * (not an ISR), so no special atomicity concerns beyond the usual volatile. */
static void cmd_vel_callback(const void *msgin) {
    const geometry_msgs__msg__Twist *msg = (const geometry_msgs__msg__Twist *)msgin;
    cmd_linear_x    = (float)msg->linear.x;
    cmd_angular_z   = (float)msg->angular.z;
    last_cmd_vel_us = esp_timer_get_time();
}

/* F5: connects to the micro-ROS agent, subscribes /cmd_vel, publishes /odom.
 * Structured the same way as the proven esp32/microros_hello.c pattern
 * (Week 1) - outer loop pings the agent and (re)creates everything on
 * connect, inner loop runs while the agent stays reachable, and everything
 * gets torn down and retried if the agent disappears.
 * No printf()/ESP_LOG calls anywhere in this function or its callers from
 * here on - confirmed live (2026-07-27) that ANY console write to UART0
 * corrupts the micro-ROS binary stream sharing the same wire, including
 * during the ping-agent phase. Silence is required, not just tidiness. */
static void uros_task(void *arg) {
    while (1) {
        while (rmw_uros_ping_agent(1000, 1) != RMW_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(500));
        }

        rcl_allocator_t allocator = rcl_get_default_allocator();
        rclc_support_t support;
        rcl_node_t node;
        rcl_subscription_t cmd_vel_sub;
        rcl_publisher_t odom_pub;
        rclc_executor_t executor;
        geometry_msgs__msg__Twist cmd_vel_msg;
        nav_msgs__msg__Odometry odom_msg = {0};

        if (rclc_support_init(&support, 0, NULL, &allocator) != RCL_RET_OK) {
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_node_init_default(&node, "esp32_motor_node", "", &support) != RCL_RET_OK) {
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_subscription_init_default(&cmd_vel_sub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(geometry_msgs, msg, Twist), "cmd_vel") != RCL_RET_OK) {
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }
        if (rclc_publisher_init_default(&odom_pub, &node,
                ROSIDL_GET_MSG_TYPE_SUPPORT(nav_msgs, msg, Odometry), "odom") != RCL_RET_OK) {
            if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
            if (rcl_node_fini(&node) != RCL_RET_OK) {}
            rclc_support_fini(&support);
            vTaskDelay(pdMS_TO_TICKS(1000)); continue;
        }

        rclc_executor_t *exec = &executor;
        rclc_executor_init(exec, &support.context, 1, &allocator);
        rclc_executor_add_subscription(exec, &cmd_vel_sub, &cmd_vel_msg, &cmd_vel_callback, ON_NEW_DATA);

        /* Set once - frame_id strings don't change per-message, only the
         * numeric fields below do. */
        odom_msg.header.frame_id.data = "odom";
        odom_msg.header.frame_id.size = strlen("odom");
        odom_msg.header.frame_id.capacity = odom_msg.header.frame_id.size + 1;
        odom_msg.child_frame_id.data = "base_link";
        odom_msg.child_frame_id.size = strlen("base_link");
        odom_msg.child_frame_id.capacity = odom_msg.child_frame_id.size + 1;

        TickType_t last_publish = xTaskGetTickCount();
        const TickType_t publish_period = pdMS_TO_TICKS(ODOM_PUBLISH_PERIOD_MS);
        bool agent_ok = true;

        while (agent_ok) {
            rclc_executor_spin_some(exec, RCL_MS_TO_NS(20));

            if (xTaskGetTickCount() - last_publish >= publish_period) {
                last_publish = xTaskGetTickCount();

                odom_msg.pose.pose.position.x = pose_x_shared;
                odom_msg.pose.pose.position.y = pose_y_shared;
                odom_msg.pose.pose.position.z = 0.0;

                /* Orientation as a quaternion, rotation about Z only (2D
                 * robot) - qz=sin(theta/2), qw=cos(theta/2), qx=qy=0. */
                float half_theta = pose_theta_shared / 2.0f;
                odom_msg.pose.pose.orientation.x = 0.0;
                odom_msg.pose.pose.orientation.y = 0.0;
                odom_msg.pose.pose.orientation.z = sinf(half_theta);
                odom_msg.pose.pose.orientation.w = cosf(half_theta);

                odom_msg.twist.twist.linear.x  = linear_vel_shared;
                odom_msg.twist.twist.angular.z = angular_vel_shared;

                if (rcl_publish(&odom_pub, &odom_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }
            }

            /* BUG FOUND 2026-07-27 (F5 first connectivity test): timeout=0
             * gives the ping response no time to actually arrive over the
             * UART round-trip, so it reported "failed" almost every cycle
             * even with the agent alive and working - confirmed live as a
             * connect/create-everything/disconnect loop every ~1-2s, right
             * after all the ROS entities were successfully created. 100ms
             * is generous for a serial round-trip without blocking the
             * executor/publish loop for long. */
            if (rmw_uros_ping_agent(100, 1) != RMW_RET_OK) {
                agent_ok = false;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }

        if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
        if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
        if (rclc_executor_fini(exec) != RCL_RET_OK) {}
        if (rcl_node_fini(&node) != RCL_RET_OK) {}
        rclc_support_fini(&support);
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* Configure the five direction/enable pins as digital outputs. */
static void setup_gpio(void) {
    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << AIN1_PIN) | (1ULL << AIN2_PIN) |
                        (1ULL << BIN1_PIN) | (1ULL << BIN2_PIN) |
                        (1ULL << STBY_PIN),
        .mode = GPIO_MODE_OUTPUT,
    };
    ESP_ERROR_CHECK(gpio_config(&cfg));
}

/* Configure the LEDC hardware to generate PWM on PWMA and PWMB.
 * LEDC does the fast HIGH/LOW switching in hardware, so app_main never
 * has to toggle the pin itself. */
static void setup_pwm(void) {
    ledc_timer_config_t timer = {
        .speed_mode      = LEDC_HIGH_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_8_BIT,   /* duty range 0..255 */
        .timer_num       = LEDC_TIMER_0,
        .freq_hz         = PWM_FREQ_HZ,
        .clk_cfg         = LEDC_AUTO_CLK,
    };
    ESP_ERROR_CHECK(ledc_timer_config(&timer));

