ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
    ledc_channel_config_t ch_a = {
        .gpio_num   = PWMA_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_0,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_a));

    ledc_channel_config_t ch_b = {
        .gpio_num   = PWMB_PIN,
        .speed_mode = LEDC_HIGH_SPEED_MODE,
        .channel    = LEDC_CHANNEL_1,
        .timer_sel  = LEDC_TIMER_0,
        .duty       = PWM_DUTY_50,
        .hpoint     = 0,
    };
    ESP_ERROR_CHECK(ledc_channel_config(&ch_b));
}

/* UART0 is the same physical wire idf.py monitor uses for the console - see
 * the F5 note on ESP_LOGI above. Reused from the proven esp32/microros_hello
 * pin/transport setup (Week 1), not a new choice. */
static size_t uart_port = UART_NUM_0;

void app_main(void) {
    setup_gpio();
    setup_pwm();

    /* Direction pins are wired for forward, but F5 now drives actual speed
     * (including reverse/turn) through /cmd_vel via control_task - these
     * just set the electrical default; PWM=0 from a stale/absent /cmd_vel
     * (the safety default) means the motors don't move regardless. */
    gpio_set_level(STBY_PIN, 1);   /* wake the TB6612FNG out of standby */
    gpio_set_level(AIN1_PIN, 1);
    gpio_set_level(AIN2_PIN, 0);
    gpio_set_level(BIN1_PIN, 1);
    gpio_set_level(BIN2_PIN, 0);

    rmw_uros_set_custom_transport(true, (void *)&uart_port,
        esp32_serial_open, esp32_serial_close,
        esp32_serial_write, esp32_serial_read);

    /* BUG FOUND 2026-07-27 (F5 first test): ESP_LOGI/ESP_LOGW in control_task
     * and the micro-ROS transport above both write to UART0 at the same
     * time - confirmed live as a burst of garbled characters in the monitor
     * output, at the same moment the micro-ROS agent never saw a valid
     * session-establish packet. The two streams were corrupting each other.
     * Once the transport is set, all console log output must stop - from
     * here on, debugging is via `ros2 topic echo` on the Jetson, not
     * idf.py monitor (see README F5 section). */
    esp_log_level_set("*", ESP_LOG_NONE);

    xTaskCreate(control_task, "control_task", 4096, NULL, 5, NULL);
    xTaskCreate(uros_task, "uros_task", 16000, NULL, 5, NULL);

    /* app_main returns here; both tasks keep running. */
}
